Repository: duribeon/Hand-Sanitizer
Catalog: 4_Program/raspi/Downloads/mifit-data-export-master/po/*.po
Languages: ru

source: unknown xiaomi device, exiting
ru: неизвестное устройство xiaomi, завершаю работу

source: backing up $device database
ru: создаю резервную копию базы $device

source: adb copy $device temp data to sdcard
ru: adb временно копирую базу $device на карту

source: adb pull $device data from sdcard to local machine
ru: adb скачиваю базу $device с карты на локальную машину

source: adb remove temp $device data on sdcard
ru: adb удаляю временную копию базы $device

source: extraction started on $(date +"%m/%d/%Y %H:%M")
ru: $(date +"%m/%d/%Y %H:%M") - извлекаю базы данных

source: cannot find database files. non-rooted phone? attempting native backup approach
ru: файлы баз не обнаружены. возможно телефон не рутован? пробую альтернативный метод

source: extracted MiBand database
ru: база MiBand извлечена

source: extracted MiScale database
ru: база MiScale извлечена

source: deleting temp backup files
ru: удаляю временные копии базы

source: extraction failed
ru: извлечение баз данных неудачно

source: still cannot find new database files - restoring original database backups
ru: файлы баз по-прежнему не обнаружены - восстанавливаю базы из резервных копий

source: ok, got new database files
ru: ок, новые файлы баз успешно извлечены

source: sqlite extraction of raw MiBand sensor data
ru: sqlite получаю голые данные сенсоров MiBand

source: sqlite extraction of MiBand data
ru: sqlite делаю выборку данных из базы MiBand

source: sqlite extraction of MiScale data
ru: sqlite делаю выборку данных из базы MiScale

source: extraction of data completed
ru: получение данных из баз успешно завершено

source: uploading weight data to Fitbit ...
ru: загружаю базу веса в сервис Fitbit ...
